PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_irda.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check irda pointer and p_init address */
    if((NULL == irda) || (NULL == p_init)) {
        HAL_DEBUGE("pointer [irda] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check periph parameter */
    if(USART0 != periph) {
        HAL_DEBUGE("parameter [periph] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check periph value from irda device struct */
    if(0U != irda->periph) {
        HAL_DEBUGI("periph value from irda device struct has been rewrite");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock irda */
    HAL_LOCK(irda);

    irda->periph = periph;

    /* disable irda */
    hals_irda_disable(periph);

    /* configure CTL0 register */
    reg_temp = USART_CTL0(periph);
    reg_temp &= ~(USART_CTL0_PM | USART_CTL0_PCEN | USART_CTL0_WL | USART_CTL0_REN | USART_CTL0_TEN);
    reg_temp |= (p_init->direction | p_init->parity | p_init->word_length);
    USART_CTL0(periph) = reg_temp;

    /* configure GP register */
    reg_temp = USART_GP(periph);
    reg_temp &= ~USART_GP_PSC;
    reg_temp |= p_init->prescaler;
    USART_GP(periph) = reg_temp;

    /* configure RFCS register */
    if(ENABLE == p_init->rx_fifo_en) {
        USART_RFCS(periph) |= USART_RFCS_RFEN;
    } else {
        USART_RFCS(periph) &= ~USART_RFCS_RFEN;
    }

    /* configure baudrate */
    hals_irda_baudrate_set(periph, p_init->baudrate);
    irda->data_bit_mask = _irda_data_bit_mask_get(irda);

    /* reset the Rx and Tx state */
    irda->tx_state = IRDA_STATE_FREE;
    irda->rx_state = IRDA_STATE_FREE;

    /* configure irda in low power mode */
    hals_irda_lowpower_config(periph, p_init->mode);
    hals_irda_mode_enable(periph);

    /* enable usart */
    hals_irda_enable(irda->periph);

    /* unlock irda */
    HAL_UNLOCK(irda);

    return HAL_ERR_NONE;
}

/*!
    \brief      irda interrupt handler content function,which is merely used in irda_handler
    \param[in]  irda: irda device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_irda_irq(hal_irda_dev_struct *irda)
{
    if(RESET == _irda_error_flag_get(irda)) {
        /* check whether IRDA is in receiver mode or not */
        if(RESET != hals_irda_interrupt_flag_get(irda->periph, USART_INT_FLAG_RBNE)) {
            if(NULL != irda->irda_irq.receive_complete_handle) {
                irda->irda_irq.receive_complete_handle(irda);
            }
            return;
        }
    } else {
        /* check whether the PERR flag is set or not */
        if(RESET != hals_irda_interrupt_flag_get(irda->periph, USART_INT_FLAG_PERR)) {
            hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_PERR);
            irda->error_state |= HAL_IRDA_ERROR_PERR;
            irda->last_error = HAL_IRDA_ERROR_PERR;
        }

        /* check whether the NERR flag is set or not */
        if(RESET != hals_irda_interrupt_flag_get(irda->periph, USART_INT_FLAG_ERR_NERR)) {
            hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_NERR);
            irda->error_state |= HAL_IRDA_ERROR_NERR;
            irda->last_error = HAL_IRDA_ERROR_NERR;
        }

        /* check whether the FERR flag is set or not */
        if(RESET != hals_irda_interrupt_flag_get(irda->periph, USART_INT_FLAG_ERR_FERR)) {
            hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_FERR);
            irda->error_state |= HAL_IRDA_ERROR_FERR;
            irda->last_error = HAL_IRDA_ERROR_FERR;
        }

        /* check whether the ERR ORERR is set or not */
        if(RESET != hals_irda_interrupt_flag_get(irda->periph, USART_INT_FLAG_ERR_ORERR)) {
            hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_ORERR);
            irda->error_state |= HAL_IRDA_ERROR_ORERR;
            irda->last_error = HAL_IRDA_ERROR_ORERR;
        }

        /* check whether RBNE ORERR is set or not */
        if(RESET != hals_irda_interrupt_flag_get(irda->periph, USART_INT_FLAG_RBNE_ORERR)) {
            hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_RBNE_ORERR);
            irda->error_state |= HAL_IRDA_ERROR_ORERR;
            irda->last_error = HAL_IRDA_ERROR_ORERR;
        }

        /* check whether error state is none or not */
        if(HAL_IRDA_ERROR_NONE != irda->error_state) {
            if(NULL != irda->irda_irq.error_handle) {
                irda->irda_irq.error_handle(irda);
                irda->error_state = HAL_IRDA_ERROR_NONE;
            }
            return;
        }
    }

    /* transmitter buffer empty interrupt handle */
    if(RESET != hals_irda_interrupt_flag_get(irda->periph, USART_INT_FLAG_TBE)) {
        if(NULL != irda->irda_irq.transmit_ready_handle) {
            irda->irda_irq.transmit_ready_handle(irda);
        }
        return;
    }

    /* transmission complete interrupt handle */
    if(RESET != hals_irda_interrupt_flag_get(irda->periph, USART_INT_FLAG_TC)) {
        hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_TC);

        if(NULL != irda->irda_irq.transmit_complete_handle) {
            irda->irda_irq.transmit_complete_handle(irda);
        }
        return;
    }
}

/*!
    \brief      set user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  irda: irda device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to irda interrupt callback functions structure
                  The structure member can be assigned as following parameters:
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: The corresponding callback mechanism is out of use, and
                    disable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_irda_irq_handle_set(hal_irda_dev_struct *irda, hal_irda_irq_struct *p_irq)
{
    /* set user-defined error interrupt callback */
    if(NULL != p_irq->error_handle) {
        irda->irda_irq.error_handle = p_irq->error_handle;
        hals_irda_interrupt_enable(irda->periph, USART_INT_ERR);
        hals_irda_interrupt_enable(irda->periph, USART_INT_PERR);
    } else {
        irda->irda_irq.error_handle = NULL;
        hals_irda_interrupt_disable(irda->periph, USART_INT_ERR);
        hals_irda_interrupt_disable(irda->periph, USART_INT_PERR);
    }

