PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_irda.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == irda) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [irda] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the rx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->rx_state) {
        HAL_DEBUGE("irda rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock irda */
    HAL_LOCK(irda);

    irda->error_state = HAL_IRDA_ERROR_NONE;
    irda->rx_state = IRDA_STATE_BUSY;

    /* initialize receive parameters */

    irda->rxbuffer.buffer   = (uint8_t *)p_buffer;
    irda->rxbuffer.length   = length;
    irda->rxbuffer.pos      = 0U;
    irda->data_bit_mask     = _irda_data_bit_mask_get(irda);

    /* calculate the data length */
    data_length = 1U;
    if(RESET != (USART_CTL0(irda->periph) & USART_CTL0_WL)) {
        if(RESET == (USART_CTL0(irda->periph) & USART_CTL0_PCEN)) {
            data_length = 2U;
        }
    }

    /* configure timeout */
    tick_start = hal_sys_basetick_count_get();

    while(irda->rxbuffer.pos < irda->rxbuffer.length) {
        /* wait for read data buffer not empty */
        while(RESET == hals_irda_flag_get(irda->periph, USART_FLAG_RBNE)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("irda receive timeout");
                    /* reset the state */
                    irda->rx_state = IRDA_STATE_FREE;
                    /* unlock irda */
                    HAL_UNLOCK(irda);

                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* read data from data register */
        if(2U == data_length) {
            *(uint16_t *)irda->rxbuffer.buffer = (hals_irda_data_receive(irda->periph) & irda->data_bit_mask);
            irda->rxbuffer.buffer += 2;
        } else {
            *irda->rxbuffer.buffer = (uint8_t)(hals_irda_data_receive(irda->periph) & irda->data_bit_mask);
            irda->rxbuffer.buffer++;
        }

        /* change the receive pointer */
        irda->rxbuffer.pos++;
    }

    /* change the Rx state to free */
    irda->rx_state = IRDA_STATE_FREE;

    /* unlock irda */
    HAL_UNLOCK(irda);

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by interrupt method
                the function is non-blocking
    \param[in]  irda: irda device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_irda_transmit_interrupt(hal_irda_dev_struct *irda, uint8_t *p_buffer, uint32_t length,
                                    hal_irda_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == irda) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [irda] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the tx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->tx_state) {
        HAL_DEBUGE("irda tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock irda */
    HAL_LOCK(irda);

    irda->tx_state = IRDA_STATE_BUSY;
    irda->error_state = HAL_IRDA_ERROR_NONE;

    /* initialize transmit parameters */
    irda->txbuffer.buffer   = (uint8_t *)p_buffer;
    irda->txbuffer.length   = length;
    irda->txbuffer.pos      = 0U;
    irda->tx_callback       = (void *)p_user_func;

    /* configure the transmit ready and complete callback as the function implemented */
    irda->irda_irq.transmit_ready_handle = _irda_transmit_interrupt;
    irda->irda_irq.transmit_complete_handle = _irda_transmit_complete_interrupt;

    /* clear IRDA TC interrupt flag */
    hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_TC);

    /* enable the TBE interrupt */
    hals_irda_interrupt_enable(irda->periph, USART_INT_TBE);

    /* unlock irda */
    HAL_UNLOCK(irda);

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by interrupt method
                the function is non-blocking
    \param[in]  irda: irda device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_irda_receive_interrupt(hal_irda_dev_struct *irda, uint8_t *p_buffer, uint32_t length,
                                   hal_irda_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == irda) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [irda] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the rx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->rx_state) {
        HAL_DEBUGE("irda rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock irda */
    HAL_LOCK(irda);

