PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_irda.c
    irda->rx_state = IRDA_STATE_BUSY;
    irda->error_state = HAL_IRDA_ERROR_NONE;

    /* initialize receive parameters */
    irda->rxbuffer.buffer   = (uint8_t *)p_buffer;
    irda->rxbuffer.length   = length;
    irda->rxbuffer.pos      = 0U;
    irda->rx_callback       = (void *)p_user_func;
    irda->irda_irq.receive_complete_handle = _irda_receive_interrupt;
    irda->data_bit_mask = _irda_data_bit_mask_get(irda);

    /* enable PERR, ERR, RBNE interrupt */
    hals_irda_interrupt_enable(irda->periph, USART_INT_PERR);
    hals_irda_interrupt_enable(irda->periph, USART_INT_ERR);
    hals_irda_interrupt_enable(irda->periph, USART_INT_RBNE);

    /* unlock irda */
    HAL_UNLOCK(irda);

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by dma method
                the function is non-blocking
    \param[in]  irda: irda device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_irda_transmit_dma(hal_irda_dev_struct *irda, uint8_t *p_buffer, uint16_t length, hal_irda_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == irda) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [irda] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check the parameter */
    if(NULL == irda->p_dma_tx) {
        HAL_DEBUGE("parameter [irda->p_dma_tx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the tx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->tx_state) {
        HAL_DEBUGE("irda tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock irda */
    HAL_LOCK(irda);

    irda->tx_state = IRDA_STATE_BUSY;
    irda->error_state = HAL_IRDA_ERROR_NONE;

    /* initialize transmit parameters */
    irda->txbuffer.buffer   = (uint8_t *)p_buffer;
    irda->txbuffer.length   = length;
    irda->txbuffer.pos      = 0U;

    if(NULL != p_func) {
        irda->tx_callback = (void *)p_func->complete_func;
        irda->irda_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    } else {
        irda->tx_callback = NULL;
        irda->irda_irq.error_handle = NULL;
    }
    irda->irda_irq.transmit_complete_handle = _irda_transmit_complete_interrupt;

    /* configure DMA interrupt callback function */
    dma_irq.full_finish_handle = _irda_transmit_dma;
    dma_irq.error_handle = _irda_dma_error;
    if(NULL != irda->p_dma_tx->dma_irq.half_finish_handle) {
        dma_irq.half_finish_handle = irda->p_dma_tx->dma_irq.half_finish_handle;
    } else {
        dma_irq.half_finish_handle = NULL;
    }

    /* start DMA interrupt mode transfer */
    if(HAL_ERR_NONE != hal_dma_start_interrupt(irda->p_dma_tx, (uint32_t)irda->txbuffer.buffer,
            (uint32_t)&USART_TDATA(irda->periph), irda->txbuffer.length, &dma_irq)) {
        irda->tx_state = IRDA_STATE_FREE;
        irda->error_state = HAL_IRDA_ERROR_DMATX;
        /* unlock uart */
        HAL_UNLOCK(irda);
    }

    /* clear IRDA TC interrupt flag */
    hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_TC);

    /* DMA enable for transmission */
    hals_irda_dma_transmit_config(irda->periph, USART_TRANSMIT_DMA_ENABLE);

    /* unlock irda */
    HAL_UNLOCK(irda);

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by dma method
                the function is non-blocking
    \param[in]  irda: irda device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_irda_receive_dma(hal_irda_dev_struct *irda, uint8_t *p_buffer, uint16_t length, hal_irda_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == irda) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [irda] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check the parameter */
    if(NULL == irda->p_dma_rx) {
        HAL_DEBUGE("parameter [irda->p_dma_rx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the rx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->rx_state) {
        HAL_DEBUGE("irda rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock irda */
    HAL_LOCK(irda);

    irda->rx_state = IRDA_STATE_BUSY;
    irda->error_state = HAL_IRDA_ERROR_NONE;

    /* initialize receive parameters */
    irda->rxbuffer.buffer   = (uint8_t *)p_buffer;
    irda->rxbuffer.length   = length;
    irda->rxbuffer.pos      = 0U;

    if(NULL != p_func) {
        irda->rx_callback = (void *)p_func->complete_func;
        irda->irda_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    } else {
        irda->rx_callback = NULL;
        irda->irda_irq.error_handle = NULL;
    }
    irda->data_bit_mask = _irda_data_bit_mask_get(irda);

    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _irda_receive_dma;
    dma_irq.error_handle = _irda_dma_error;
    if(NULL != irda->p_dma_rx->dma_irq.half_finish_handle) {
        dma_irq.half_finish_handle = irda->p_dma_rx->dma_irq.half_finish_handle;
    } else {
        dma_irq.half_finish_handle = NULL;
    }

    /* start DMA interrupt mode transfer */
    if(HAL_ERR_NONE != hal_dma_start_interrupt(irda->p_dma_rx, (uint32_t)&USART_RDATA(irda->periph),
            (uint32_t)irda->rxbuffer.buffer, irda->rxbuffer.length, &dma_irq)) {
        irda->rx_state = IRDA_STATE_FREE;
        irda->error_state = HAL_IRDA_ERROR_DMARX;
        /* unlock uart */
        HAL_UNLOCK(irda);
    }

