PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_irda.c
    /* enable the usart parity error and error interrupt: (frame error, noise error, overrun error)  */
    hals_irda_interrupt_enable(irda->periph, USART_INT_PERR);
    hals_irda_interrupt_enable(irda->periph, USART_INT_ERR);

    /* DMA enable for reception */
    hals_irda_dma_receive_config(irda->periph, USART_RECEIVE_DMA_ENABLE);

    /* unlock irda */
    HAL_UNLOCK(irda);

    return HAL_ERR_NONE;
}

/*!
    \brief      pause irda DMA transfer during transmission process
    \param[in]  irda: irda device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32f3x0_hal.h
*/
int32_t hal_irda_dma_pause(hal_irda_dev_struct *irda)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == irda) {
        HAL_DEBUGE("parameter [irda] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock irda */
    HAL_LOCK(irda);

    /* check the tx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->tx_state) {
        /* disable DMA transimt */
        hals_irda_dma_transmit_config(irda->periph, USART_TRANSMIT_DMA_DISABLE);
    }

    /* check the rx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->rx_state) {
        /* disable the PERR and ERR interrupt */
        hals_irda_interrupt_disable(irda->periph, USART_INT_PERR);
        hals_irda_interrupt_disable(irda->periph, USART_INT_ERR);

        /* disable DMA receive */
        hals_irda_dma_receive_config(irda->periph, USART_RECEIVE_DMA_DISABLE);
    }

    /* unlock irda */
    HAL_UNLOCK(irda);

    return HAL_ERR_NONE;
}

/*!
    \brief      resume irda DMA transfer during transmission process
    \param[in]  irda: irda device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32f3x0_hal.h
*/
int32_t hal_irda_dma_resume(hal_irda_dev_struct *irda)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == irda) {
        HAL_DEBUGE("parameter [irda] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock irda */
    HAL_LOCK(irda);

    /* check the tx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->tx_state) {
        /* enable DMA transimt */
        hals_irda_dma_transmit_config(irda->periph, USART_TRANSMIT_DMA_ENABLE);
    }

    /* check the rx_state wheher is busy or not */
    if(IRDA_STATE_BUSY == irda->rx_state) {
        /* enable the PERR and ERR interrupt */
        hals_irda_interrupt_enable(irda->periph, USART_INT_PERR);
        hals_irda_interrupt_enable(irda->periph, USART_INT_ERR);

        /* enable DMA receive */
        hals_irda_dma_receive_config(irda->periph, USART_RECEIVE_DMA_ENABLE);
    }

    /* unlock irda */
    HAL_UNLOCK(irda);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop irda transmit transfer
                the function is blocking
    \param[in]  irda: irda device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32f3x0_hal.h
*/
int32_t hal_irda_transmit_stop(hal_irda_dev_struct *irda)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == irda) {
        HAL_DEBUGE("parameter [irda] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock irda */
    HAL_LOCK(irda);

    /* disable the TBE and TC interrupt */
    hals_irda_interrupt_disable(irda->periph, USART_INT_TBE);
    hals_irda_interrupt_disable(irda->periph, USART_INT_TC);

    /* disable DMA transimt and stop DMA */
    hals_irda_dma_transmit_config(irda->periph, USART_TRANSMIT_DMA_DISABLE);
    hal_dma_stop(irda->p_dma_tx);

    /* reset the position and state */
    irda->txbuffer.pos = 0;
    irda->tx_state = IRDA_STATE_FREE;

    /* unlock irda */
    HAL_UNLOCK(irda);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop irda receive transfer
                the function is blocking
    \param[in]  irda: irda device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32f3x0_hal.h
*/
int32_t hal_irda_receive_stop(hal_irda_dev_struct *irda)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == irda) {
        HAL_DEBUGE("parameter [irda] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock irda */
    HAL_LOCK(irda);

    /* disable the RBNE, PERR and ERR interrupt */
    hals_irda_interrupt_disable(irda->periph, USART_INT_RBNE);
    hals_irda_interrupt_disable(irda->periph, USART_INT_PERR);
    hals_irda_interrupt_disable(irda->periph, USART_INT_ERR);

    /* disable DMA receive and stop DMA */
    hals_irda_dma_receive_config(irda->periph, USART_RECEIVE_DMA_DISABLE);
    hal_dma_stop(irda->p_dma_rx);

    /* reset the position and state */
    irda->rxbuffer.pos = 0;
    irda->rx_state = IRDA_STATE_FREE;

    /* clear interrupt error flags */
    hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_PERR);
    hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_FERR);
    hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_NERR);
    hals_irda_interrupt_flag_clear(irda->periph, USART_INT_FLAG_ERR_ORERR);

    /* unlock irda */
    HAL_UNLOCK(irda);

