PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_irda.c
    return HAL_ERR_NONE;
}

/*!
    \brief      reset IRDA
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_irda_deinit(uint32_t irda_periph)
{
    switch(irda_periph) {
    case USART0:
        /* reset USART0 */
        hal_rcu_periph_reset_enable(RCU_USART0RST);
        hal_rcu_periph_reset_disable(RCU_USART0RST);
        break;
    case USART1:
        /* reset USART1 */
        hal_rcu_periph_reset_enable(RCU_USART1RST);
        hal_rcu_periph_reset_disable(RCU_USART1RST);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure IRDA baud rate value
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  baudval: baud rate value
    \param[out] none
    \retval     none
*/
void hals_irda_baudrate_set(uint32_t irda_periph, uint32_t baudval)
{
    uint32_t uclk = 0U, intdiv = 0U, fradiv = 0U, udiv = 0U;
    switch(irda_periph) {
    /* get clock frequency */
    case USART0:
        /* get USART0 clock */
        uclk = hals_rcu_clock_freq_get(CK_USART);
        break;
    case USART1:
        /* get USART1 clock */
        uclk = hals_rcu_clock_freq_get(CK_APB1);
        break;
    default:
        break;
    }
    if(USART_CTL0(irda_periph) & USART_CTL0_OVSMOD) {
        /* oversampling by 8, configure the value of USART_BAUD */
        udiv = ((2U * uclk) + (baudval / 2U)) / baudval;
        intdiv = udiv & 0x0000fff0U;
        fradiv = (udiv >> 1U) & 0x00000007U;
        USART_BAUD(irda_periph) = ((USART_BAUD_FRADIV | USART_BAUD_INTDIV) & (intdiv | fradiv));
    } else {
        /* oversampling by 16, configure the value of USART_BAUD */
        udiv = (uclk + (baudval / 2U)) / baudval;
        intdiv = udiv & 0x0000fff0U;
        fradiv = udiv & 0x0000000fU;
        USART_BAUD(irda_periph) = ((USART_BAUD_FRADIV | USART_BAUD_INTDIV) & (intdiv | fradiv));
    }
}

/*!
    \brief      configure IRDA parity
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  paritycfg: IRDA parity configure
                only one parameter can be selected which is shown as below:
      \arg        USART_PM_NONE: no parity
      \arg        USART_PM_ODD: odd parity
      \arg        USART_PM_EVEN: even parity
    \param[out] none
    \retval     none
*/
void hals_irda_parity_config(uint32_t irda_periph, uint32_t paritycfg)
{
    /* disable IRDA */
    USART_CTL0(irda_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL0 PM,PCEN bits */
    USART_CTL0(irda_periph) &= ~(USART_CTL0_PM | USART_CTL0_PCEN);
    /* configure IRDA parity mode */
    USART_CTL0(irda_periph) |= paritycfg;
}

/*!
    \brief      configure IRDA word length
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  wlen: IRDA word length configure
                only one parameter can be selected which is shown as below:
      \arg        USART_WL_8BIT: 8 bits
      \arg        USART_WL_9BIT: 9 bits
    \param[out] none
    \retval     none
*/
void hals_irda_word_length_set(uint32_t irda_periph, uint32_t wlen)
{
    /* disable IRDA */
    USART_CTL0(irda_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL0 WL bit */
    USART_CTL0(irda_periph) &= ~USART_CTL0_WL;
    /* configure IRDA word length */
    USART_CTL0(irda_periph) |= wlen;
}

/*!
    \brief      configure IRDA stop bit length
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  stblen: IRDA stop bit configure
                only one parameter can be selected which is shown as below:
      \arg        USART_STB_1BIT: 1 bit
      \arg        USART_STB_0_5BIT: 0.5bit
      \arg        USART_STB_2BIT: 2 bits
      \arg        USART_STB_1_5BIT: 1.5bit
    \param[out] none
    \retval     none
*/
void hals_irda_stop_bit_set(uint32_t irda_periph, uint32_t stblen)
{
    /* disable IRDA */
    USART_CTL0(irda_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL1 STB bits */
    USART_CTL1(irda_periph) &= ~USART_CTL1_STB;
    USART_CTL1(irda_periph) |= stblen;
}

/*!
    \brief      enable IRDA
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_irda_enable(uint32_t irda_periph)
{
    USART_CTL0(irda_periph) |= USART_CTL0_UEN;
}

/*!
    \brief      disable IRDA
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_irda_disable(uint32_t irda_periph)
{
    USART_CTL0(irda_periph) &= ~(USART_CTL0_UEN);
}

/*!
    \brief      configure IRDA transmitter
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  txconfig: enable or disable IRDA transmitter
                only one parameter can be selected which is shown as below:
      \arg        USART_TRANSMIT_ENABLE: enable IRDA transmission
      \arg        USART_TRANSMIT_DISABLE: enable IRDA transmission
    \param[out] none
    \retval     none
*/
void hals_irda_transmit_config(uint32_t irda_periph, uint32_t txconfig)
{
    USART_CTL0(irda_periph) &= ~USART_CTL0_TEN;
    /* configure transfer mode */
    USART_CTL0(irda_periph) |= txconfig;
}

/*!
    \brief      configure IRDA receiver
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  rxconfig: enable or disable IRDA receiver
                only one parameter can be selected which is shown as below:
      \arg        USART_RECEIVE_ENABLE: enable IRDA reception
      \arg        USART_RECEIVE_DISABLE: disable IRDA reception
    \param[out] none
    \retval     none
*/
void hals_irda_receive_config(uint32_t irda_periph, uint32_t rxconfig)
{
    USART_CTL0(irda_periph) &= ~USART_CTL0_REN;
    /* configure receiver mode */
    USART_CTL0(irda_periph) |= rxconfig;
}

/*!
    \brief      IRDA transmit data function
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  data: data of transmission
    \param[out] none
    \retval     none
*/
void hals_irda_data_transmit(uint32_t irda_periph, uint16_t data)
{
    USART_TDATA(irda_periph) = (USART_TDATA_TDATA & (uint32_t)data);
}

/*!
    \brief      IRDA receive data function
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[out] none
    \retval     data of received
*/
uint16_t hals_irda_data_receive(uint32_t irda_periph)
{
    return (uint16_t)(GET_BITS(USART_RDATA(irda_periph), 0U, 8U));
}

/*!
    \brief      enable irda mode
    \param[in]  irda_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_irda_mode_enable(uint32_t irda_periph)
{
    /* disable IRDA */
    USART_CTL0(irda_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(irda_periph) |= USART_CTL2_IREN;
}

/*!
    \brief      disable irda mode
    \param[in]  irda_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_irda_mode_disable(uint32_t irda_periph)
{
    /* disable IRDA */
    USART_CTL0(irda_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(irda_periph) &= ~(USART_CTL2_IREN);
}

/*!
    \brief      configure the peripheral clock prescaler in IRDA irda low-power or smartcard mode
    \param[in]  irda_periph: USARTx(x=0)
    \param[in]  psc: 0x00000000-0x000000FF
    \param[out] none
    \retval     none
*/
void hals_irda_prescaler_config(uint32_t irda_periph, uint32_t psc)
{
    /* disable IRDA */
    USART_CTL0(irda_periph) &= ~(USART_CTL0_UEN);
    USART_GP(irda_periph) &= ~(USART_GP_PSC);
    USART_GP(irda_periph) |= psc;
}

/*!
    \brief      configure irda low-power
    \param[in]  irda_periph: USARTx(x=0)
    \param[in]  irlp: irda low-power or normal
                only one parameter can be selected which is shown as below:
      \arg        USART_IRLP_LOW:    low-power
      \arg        USART_IRLP_NORMAL: normal
    \param[out] none
    \retval     none
*/
void hals_irda_lowpower_config(uint32_t irda_periph, uint32_t irlp)
{
    /* disable IRDA */
    USART_CTL0(irda_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(irda_periph) &= ~(USART_CTL2_IRLP);
    USART_CTL2(irda_periph) |= (USART_CTL2_IRLP & irlp);
}

/*!
    \brief      configure IRDA DMA reception
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  dmacmd: IRDA DMA mode
                only one parameter can be selected which is shown as below:
      \arg        USART_RECEIVE_DMA_ENABLE: enable IRDA DMA for reception
      \arg        USART_RECEIVE_DMA_DISABLE: disable IRDA DMA for reception
    \param[out] none
    \retval     none
*/
void hals_irda_dma_receive_config(uint32_t irda_periph, uint8_t dmacmd)
{
    USART_CTL2(irda_periph) &= ~USART_CTL2_DENR;
    USART_CTL2(irda_periph) |= (USART_CTL2_DENR & dmacmd);
}

/*!
    \brief      configure IRDA DMA transmission
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  dmacmd: IRDA DMA mode
                only one parameter can be selected which is shown as below:
      \arg        USART_TRANSMIT_DMA_ENABLE: enable IRDA DMA for transmission
      \arg        USART_TRANSMIT_DMA_DISABLE: disable IRDA DMA for transmission
    \param[out] none
    \retval     none
*/
void hals_irda_dma_transmit_config(uint32_t irda_periph, uint8_t dmacmd)
{
    USART_CTL2(irda_periph) &= ~USART_CTL2_DENT;
    USART_CTL2(irda_periph) |= (USART_CTL2_DENT & dmacmd);
}

/*!
    \brief      enable DMA on reception error
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_irda_reception_error_dma_enable(uint32_t irda_periph)
{
    /* disable IRDA */
    USART_CTL0(irda_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(irda_periph) &= ~(USART_CTL2_DDRE);
}

/*!
    \brief      disable DMA on reception error
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_irda_reception_error_dma_disable(uint32_t irda_periph)
{
    /* disable IRDA */
    USART_CTL0(irda_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(irda_periph) |= USART_CTL2_DDRE;
}

/*!
    \brief      get IRDA status
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise error flag
      \arg        USART_FLAG_ORERR: overrun error flag
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_RBNE: read data buffer not empty
      \arg        USART_FLAG_TC: transmission complete flag
      \arg        USART_FLAG_TBE: transmit data register empty
      \arg        USART_FLAG_LBD: LIN break detected flag
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_CTS: CTS level
      \arg        USART_FLAG_RT: receiver timeout flag
      \arg        USART_FLAG_EB: end of block flag
      \arg        USART_FLAG_BSY: busy flag
      \arg        USART_FLAG_AM: address match flag
      \arg        USART_FLAG_SB: send break flag
      \arg        USART_FLAG_RWU: receiver wakeup from mute mode.
      \arg        USART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_FLAG_TEA: transmit enable acknowledge flag
      \arg        USART_FLAG_REA: receive enable acknowledge flag
      \arg        USART_FLAG_EPERR: early parity error flag
      \arg        USART_FLAG_RFE: receive FIFO empty flag
      \arg        USART_FLAG_RFF: receive FIFO full flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hals_irda_flag_get(uint32_t irda_periph, usart_flag_enum flag)
{
    if(RESET != (USART_REG_VAL(irda_periph, flag) & BIT(USART_BIT_POS(flag)))) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear IRDA status
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise error flag
      \arg        USART_FLAG_ORERR: overrun error flag
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_TC: transmission complete flag
      \arg        USART_FLAG_LBD: LIN break detected flag
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_RT: receiver timeout flag
      \arg        USART_FLAG_EB: end of block flag
      \arg        USART_FLAG_AM: address match flag
      \arg        USART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_FLAG_EPERR: early parity error flag
    \param[out] none
    \retval     none
*/
void hals_irda_flag_clear(uint32_t irda_periph, usart_flag_enum flag)
{
    USART_INTC(irda_periph) |= BIT(USART_BIT_POS(flag));
}

/*!
    \brief      enable IRDA interrupt
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  interrupt: interrupt
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle line detected interrupt
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TBE: transmitter buffer empty interrupt
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM: address match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt
      \arg        USART_INT_EB: end of block interrupt
      \arg        USART_INT_LBD: LIN break detection interrupt
      \arg        USART_INT_ERR: error interrupt
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART_INT_RFF: receive FIFO full interrupt
    \param[out] none
    \retval     none
*/
void hals_irda_interrupt_enable(uint32_t irda_periph, usart_interrupt_enum interrupt)
{
    USART_REG_VAL(irda_periph, interrupt) |= BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      disable IRDA interrupt
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  interrupt: interrupt
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle interrupt
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TBE: transmitter buffer empty interrupt
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM: address match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt
      \arg        USART_INT_EB: end of block interrupt
      \arg        USART_INT_LBD: LIN break detection interrupt
      \arg        USART_INT_ERR: error interrupt
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART_INT_RFF: receive FIFO full interrupt
    \param[out] none
    \retval     none
*/
void hals_irda_interrupt_disable(uint32_t irda_periph, usart_interrupt_enum interrupt)
{
    USART_REG_VAL(irda_periph, interrupt) &= ~BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      get IRDA interrupt flag status
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  int_flag: interrupt and flag type, refer to usart_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_EB: end of block interrupt flag
      \arg        USART_INT_FLAG_RT: receiver timeout interrupt flag
      \arg        USART_INT_FLAG_AM: address match interrupt flag
      \arg        USART_INT_FLAG_PERR: parity error interrupt flag
      \arg        USART_INT_FLAG_TBE: transmitter buffer empty interrupt flag
      \arg        USART_INT_FLAG_TC: transmission complete interrupt flag
      \arg        USART_INT_FLAG_RBNE: read data buffer not empty interrupt flag
      \arg        USART_INT_FLAG_RBNE_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_IDLE: idle line detected interrupt flag
      \arg        USART_INT_FLAG_LBD: LIN break detected interrupt flag
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode interrupt flag
      \arg        USART_INT_FLAG_CTS: CTS interrupt flag
      \arg        USART_INT_FLAG_ERR_NERR: noise error interrupt flag
      \arg        USART_INT_FLAG_ERR_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_ERR_FERR: frame error interrupt flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hals_irda_interrupt_flag_get(uint32_t irda_periph, usart_interrupt_flag_enum int_flag)
{
    uint32_t intenable = 0U, flagstatus = 0U;
    /* get the interrupt enable bit status */
    intenable = (USART_REG_VAL(irda_periph, int_flag) & BIT(USART_BIT_POS(int_flag)));
    /* get the corresponding flag bit status */
    flagstatus = (USART_REG_VAL2(irda_periph, int_flag) & BIT(USART_BIT_POS2(int_flag)));

    if(flagstatus && intenable) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear IRDA interrupt flag
    \param[in]  irda_periph: USARTx(x=0,1)
    \param[in]  flag: IRDA interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_EB: end of block interrupt flag
      \arg        USART_INT_FLAG_RT: receiver timeout interrupt flag
      \arg        USART_INT_FLAG_AM: address match interrupt flag
      \arg        USART_INT_FLAG_PERR: parity error interrupt flag
      \arg        USART_INT_FLAG_TC: transmission complete interrupt flag
      \arg        USART_INT_FLAG_RBNE_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_IDLE: idle line detected interrupt flag
      \arg        USART_INT_FLAG_LBD: LIN break detected interrupt flag
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode interrupt flag
      \arg        USART_INT_FLAG_CTS: CTS change interrupt flag
      \arg        USART_INT_FLAG_ERR_FERR: frame error interrupt flag
      \arg        USART_INT_FLAG_ERR_NERR: noise detected interrupt flag
      \arg        USART_INT_FLAG_ERR_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt flag
    \param[out] none
    \retval     none
*/
void hals_irda_interrupt_flag_clear(uint32_t irda_periph, usart_interrupt_flag_enum int_flag)
{
    if(USART_INT_FLAG_RFF == int_flag) {
        USART_RFCS(irda_periph) &= (uint32_t)(~USART_RFCS_RFFINT);
    } else {
        USART_INTC(irda_periph) |= BIT(USART_BIT_POS2(int_flag));
    }
}

/*!
    \brief      get the mask of data bit
    \param[in]  irda: irda device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the mask of data bit(0x7F, 0xFF, 0x1FF)
*/
static uint16_t _irda_data_bit_mask_get(hal_irda_dev_struct *irda)
{
    uint16_t reval;

    if(RESET != (USART_CTL0(irda->periph) & USART_CTL0_WL)) {
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(irda->periph) & USART_CTL0_PCEN)) {
            reval = 0xFFU;
        } else {
            reval = 0x1FFU;
        }
    } else {
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(irda->periph) & USART_CTL0_PCEN)) {
            reval = 0x7FU;
        } else {
            reval = 0xFFU;
        }
    }

    return reval;
}

/*!
    \brief      get irda error flag
    \param[in]  irda: irda device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     SET or RESET
*/
static FlagStatus _irda_error_flag_get(hal_irda_dev_struct *irda)
{
    if(0U == (USART_STAT(irda->periph) & (uint32_t)(USART_STAT_PERR | USART_STAT_FERR | \
              USART_STAT_ORERR | USART_STAT_NERR))) {
        return RESET;
    } else {
        return SET;
    }
}

/*!
    \brief      handle the transmit complete interrupt
    \param[in]  irda: pointer to a irda device information structure
    \param[out] none
    \retval     none
*/
static void _irda_transmit_complete_interrupt(void *irda)
{
    hal_irda_dev_struct *p_irda = irda;
    hal_irda_user_cb p_func = (hal_irda_user_cb)p_irda->tx_callback;

