PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_irda.c
    /* disable the transmit complete interrupt */
    hals_irda_interrupt_disable(p_irda->periph, USART_INT_TC);
    /* reset transmit_complete_handle and tx_state */
    p_irda->irda_irq.transmit_complete_handle = NULL;
    p_irda->tx_state = IRDA_STATE_FREE;

    if(NULL != p_func) {
        /* if there is a user transmit complete callback */
        p_func(p_irda);
    }
}

/*!
    \brief      handle the transmit interrupt
    \param[in]  irda: pointer to a irda device information structure
    \param[out] none
    \retval     none
*/
static void _irda_transmit_interrupt(void *irda)
{
    uint32_t temp_val;
    hal_irda_dev_struct *p_irda = irda;

    temp_val = p_irda->txbuffer.pos;
    if(temp_val < p_irda->txbuffer.length) {
        if((RESET != (USART_CTL0(p_irda->periph) & USART_CTL0_WL)) && \
                (RESET == (USART_CTL0(p_irda->periph) & USART_CTL0_PCEN))) {
            /* 9-bit data, none parity */
            hals_irda_data_transmit(p_irda->periph, (*(uint16_t *)p_irda->txbuffer.buffer & (uint16_t)0x1FFU));
            p_irda->txbuffer.buffer += 2U;
        } else {
            /* 9-bit data, with parity or 8-bit data */
            hals_irda_data_transmit(p_irda->periph, (*p_irda->txbuffer.buffer & (uint8_t)0xFFU));
            p_irda->txbuffer.buffer++;
        }
        p_irda->txbuffer.pos++;
    } else {
        /* disable the TBE interrupt, enable the TC interrupt and reset the transmit_ready_handle */
        hals_irda_interrupt_disable(p_irda->periph, USART_INT_TBE);
        hals_irda_interrupt_enable(p_irda->periph, USART_INT_TC);
        p_irda->irda_irq.transmit_ready_handle = NULL;
    }
}

/*!
    \brief      handle the receive interrupt
    \param[in]  irda: pointer to a irda device information structure
    \param[out] none
    \retval     none
*/
static void _irda_receive_interrupt(void *irda)
{
    hal_irda_dev_struct *p_irda = irda;
    hal_irda_user_cb p_func = (hal_irda_user_cb)p_irda->rx_callback;

    /* store the received data */
    if(0x1FFU == p_irda->data_bit_mask) {
        *(uint16_t *)p_irda->rxbuffer.buffer = (hals_irda_data_receive(p_irda->periph) &
                                                p_irda->data_bit_mask);
        p_irda->rxbuffer.buffer += 2U;
    } else {
        *p_irda->rxbuffer.buffer = (uint8_t)(hals_irda_data_receive(p_irda->periph) &
                                             p_irda->data_bit_mask);
        p_irda->rxbuffer.buffer++;
    }
    p_irda->rxbuffer.pos++;

    if(p_irda->rxbuffer.pos == p_irda->rxbuffer.length) {
        /* disable PERR, ERR, RBNE interrupt */
        hals_irda_interrupt_disable(p_irda->periph, USART_INT_PERR);
        hals_irda_interrupt_disable(p_irda->periph, USART_INT_ERR);
        hals_irda_interrupt_disable(p_irda->periph, USART_INT_RBNE);

        /* reset receive_complete_handle and rx_state */
        p_irda->irda_irq.receive_complete_handle = NULL;
        p_irda->rx_state = IRDA_STATE_FREE;

        if(NULL != p_func) {
            /* if there is a user receive complete callback */
            p_func(p_irda);
        }
    }
}

/*!
    \brief      handle the irda DMA transmit process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _irda_transmit_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_irda_dev_struct *p_irda;

    p_dma = (hal_dma_dev_struct *)dma;
    p_irda = (hal_irda_dev_struct *)p_dma->p_periph;

    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        p_irda->txbuffer.pos = p_irda->txbuffer.length;
        hals_irda_dma_transmit_config(p_irda->periph, USART_TRANSMIT_DMA_DISABLE);
        /* enable TC interrupt */
        hals_irda_interrupt_enable(p_irda->periph, USART_INT_TC);
    }
}

/*!
    \brief      handle the irda DMA receive process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _irda_receive_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_irda_dev_struct *p_irda;
    hal_irda_user_cb p_func;

    p_dma = (hal_dma_dev_struct *)dma;
    p_irda = (hal_irda_dev_struct *)p_dma->p_periph;
    p_func = (hal_irda_user_cb)p_irda->rx_callback;

    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        p_irda->rxbuffer.pos = p_irda->rxbuffer.length;
        /* disable DMA receive, PERR and ERR interrupt */
        hals_irda_dma_receive_config(p_irda->periph, USART_RECEIVE_DMA_DISABLE);
        hals_irda_interrupt_disable(p_irda->periph, USART_INT_PERR);
        hals_irda_interrupt_disable(p_irda->periph, USART_INT_ERR);
        /* reset rx_state */
        p_irda->rx_state = IRDA_STATE_FREE;
    }

    if(NULL != p_func) {
        /* if there is a user receive complete callback */
        p_func(p_irda);
    }
}

/*!
    \brief      handle the irda DMA error process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _irda_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_irda_dev_struct *p_irda;

    p_dma = (hal_dma_dev_struct *)dma;
    p_irda = (hal_irda_dev_struct *)p_dma->p_periph;

    if(IRDA_STATE_BUSY == p_irda->tx_state) {
        /* transmit state is busy */
        p_irda->error_state |= HAL_SMARTCARD_ERROR_DMATX;
        p_irda->last_error = HAL_SMARTCARD_ERROR_DMATX;
        p_irda->txbuffer.pos = p_irda->txbuffer.length;

        /* disable DMA transmit and reset tx_state */
        hals_irda_dma_transmit_config(p_irda->periph, USART_TRANSMIT_DMA_DISABLE);
        p_irda->tx_state = IRDA_STATE_FREE;
    } else if(IRDA_STATE_BUSY == p_irda->rx_state) {
        /* receive state is busy */
        p_irda->error_state |= HAL_SMARTCARD_ERROR_DMARX;
        p_irda->last_error = HAL_SMARTCARD_ERROR_DMARX;
        p_irda->rxbuffer.pos = p_irda->rxbuffer.length;

        /* disable DMA receive, PERR, ERR interrupt */
        hals_irda_dma_receive_config(p_irda->periph, USART_RECEIVE_DMA_DISABLE);
        hals_irda_interrupt_disable(p_irda->periph, USART_INT_PERR);
        hals_irda_interrupt_disable(p_irda->periph, USART_INT_ERR);
        /* reset rx_state */
        p_irda->rx_state = IRDA_STATE_FREE;
    } else {
        HAL_DEBUGE("irda processor fatal error: dma error exception due to run state");
    }

    if(p_irda->irda_irq.error_handle != NULL) {
        /* if there is a user error callback */
        p_irda->irda_irq.error_handle(p_irda);
        p_irda->error_state = HAL_IRDA_ERROR_NONE;
    }
}
